Revit 2027 API
DuctLiningType.Roughness Property
 The roughness of Duct Lining.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Roughness { get; set; }
Public Property Roughness As Double
	Get
	Set
public:
property double Roughness {
	double get ();
	void set (double value);
}
member Roughness : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The roughness value should be at least equal to or larger than 0.
See Also
Reference
DuctLiningType Class
Autodesk.Revit.DB.Mechanical Namespace